cnf/DataProcessors/МоиСтоПервыхДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<DataProcessor>
		<Properties>
			<Name>МоиСтоПервыхДокументов</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

cnf/Documents/ПриходнаяНакладная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ПриходнаяНакладная</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиМатериалов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Материал</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cnf/Documents/ОказаниеУслуги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ОказаниеУслуги</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиМатериалов</xr:Item>
				<xr:Item>AccumulationRegister.СтоимостьМатериалов</xr:Item>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Мастер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПереченьНоменклатуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cnf/DataProcessors/МоиСтоПервыхДокументов/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура СоздатьСтоДокументовНаСервере()
	Счетчик = 0;
	а = 100;
	Пока Счетчик <= а Цикл;
		Счетчик = Счетчик +1;
		
		ДокНакл = Документы.ПриходнаяНакладная.СоздатьДокумент();
		ДокНакл.Дата = ТекущаяДата();
		ДокНакл.Склад = Справочники.Склады.Основной;
		//Для документа ПриходнаяНакладная
		Товар = ДокНакл.Материалы.Добавить();
		Товар.Материал = Справочники.Номенклатура.НайтиПоКоду("000000005");
		Товар.Цена = 10;
		Товар.Количество = Счетчик;
		Товар.Сумма = Товар.Цена * Товар.Количество;
		ДокНакл.Записать(РежимЗаписиДокумента.Проведение);
				
		//Для документа ОказаниеУслуги 
		ДокУсл = Документы.ОказаниеУслуги.СоздатьДокумент();
        ДокУсл.Дата = ТекущаяДата();
		ДокУсл.Склад = Справочники.Склады.Основной;
		ДокУсл.Клиент = Справочники.Клиенты.НайтиПоКоду("000000001");
		ДокУсл.Мастер = Справочники.Сотрудники.НайтиПоКоду("000000002");
		
		Товар = ДокУсл.ПереченьНоменклатуры.Добавить();
		Товар.Номенклатура = Справочники.Номенклатура.НайтиПоКоду("000000005");
		Товар.Цена = 10;
		Товар.Количество = Счетчик;
		Товар.Сумма = Товар.Цена * Товар.Количество;

		Услуга = ДокУсл.ПереченьНоменклатуры.Добавить();
		Услуга.Номенклатура = Справочники.Номенклатура.НайтиПоКоду("000000011");
		Услуга.Цена = 100;
		Услуга.Стоимость = 50;  
		Услуга.Количество = Счетчик;
		Услуга.Сумма = (Услуга.Цена + Услуга.Стоимость) * Услуга.Количество; 
		
		ДокУсл.Записать(РежимЗаписиДокумента.Проведение);
		КонецЦикла
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСтоДокументов(Команда)
	СоздатьСтоДокументовНаСервере();
КонецПроцедуры

&НаСервере
Процедура СтоДокументовОказаниеУслугиНаСервере()
	Счетчик = 0;
	а = 100;
	Пока Счетчик <= а Цикл;
		Счетчик = Счетчик +1;
		
		ДокУсл = Документы.ОказаниеУслуги.СоздатьДокумент();
		ДокУсл.Дата = ТекущаяДата();
		ДокУсл.Склад = Справочники.Склады.Основной;
		ДокУсл.Клиент = Справочники.Клиенты.НайтиПоКоду("000000001");
		ДокУсл.Мастер = Справочники.Сотрудники.НайтиПоКоду("000000002");
		
		Товар = ДокУсл.ПереченьНоменклатуры.Добавить();
		Товар.Номенклатура = Справочники.Номенклатура.НайтиПоКоду("000000005");
		Товар.Цена = 10;
		Товар.Количество = Счетчик;
		Товар.Сумма = Товар.Цена * Товар.Количество;
		
		Услуга = ДокУсл.ПереченьНоменклатуры.Добавить();
		Услуга.Номенклатура = Справочники.Номенклатура.НайтиПоКоду("000000011");
		Услуга.Цена = 100;
		Услуга.Стоимость = 50;  
		Услуга.Количество = Счетчик;
		Услуга.Сумма = (Услуга.Цена + Услуга.Стоимость) * Услуга.Количество; 
		
		ДокУсл.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла
КонецПроцедуры

&НаКлиенте
Процедура СтоДокументовОказаниеУслуги(Команда)
	СтоДокументовОказаниеУслугиНаСервере();
КонецПроцедуры
